SimFlow/GasJet/SimpleTest/SimpleTest/0/U
FoamFile
{
	version	2.0;
	format	binary;
	class	volVectorField;
	location	"0";
	object	U;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (0 0 0);
boundaryField
{
	GasJetSmaller_in
	{
		type	pressureInletOutletVelocity;
		value	uniform (0 0 0);
		rho	rho;
	}
	GasJetSmaller_out
	{
		type	pressureInletOutletVelocity;
		value	uniform (0 0 0);
		rho	rho;
	}
	GasJetSmaller_dyn_wall
	{
		type	noSlip;
	}
	GasJetSmaller_nil_wall
	{
		type	noSlip;
	}
}
