SimFlow/GasJet/SimpleTest/SimpleTest/0/epsilon
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	epsilon;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -3 0 0 0 0];
internalField	uniform 1;
boundaryField
{
	GasJetSmaller_in
	{
		type	turbulentMixingLengthDissipationRateInlet;
		value	uniform 1;
		mixingLength	0.001;
	}
	GasJetSmaller_out
	{
		type	turbulentMixingLengthDissipationRateInlet;
		value	uniform 1;
		mixingLength	0.001;
	}
	GasJetSmaller_dyn_wall
	{
		type	epsilonWallFunction;
		value	uniform 1;
	}
	GasJetSmaller_nil_wall
	{
		type	epsilonWallFunction;
		value	uniform 1;
	}
}
