SimFlow/GasJet/SimpleTest/SimpleTest/0/k
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	k;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -2 0 0 0 0];
internalField	uniform 0.009999999776482582;
boundaryField
{
	GasJetSmaller_in
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 0.009999999776482582;
		intensity	0.05;
	}
	GasJetSmaller_out
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 0.009999999776482582;
		intensity	0.05;
	}
	GasJetSmaller_dyn_wall
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
	GasJetSmaller_nil_wall
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
}
