SimFlow/GasJet/SimpleTest/SimpleTest/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-0.0075 -5.9396966e-4 -5.9396966e-4)
	(-0.0075 -5.9396966e-4 5.9396966e-4)
	(0.0036999998 -5.9396966e-4 5.9396966e-4)
	(0.0036999998 -5.9396966e-4 -5.9396966e-4)
	(-0.0075 5.9396966e-4 -5.9396966e-4)
	(-0.0075 5.9396966e-4 5.9396966e-4)
	(0.0036999998 5.9396966e-4 5.9396966e-4)
	(0.0036999998 5.9396966e-4 -5.9396966e-4)
	(-0.0075 -0.001979899 -0.001979899)
	(-0.0075 -0.001979899 0.001979899)
	(0.0036999998 -0.001979899 0.001979899)
	(0.0036999998 -0.001979899 -0.001979899)
	(-0.0075 0.001979899 -0.001979899)
	(-0.0075 0.001979899 0.001979899)
	(0.0036999998 0.001979899 0.001979899)
	(0.0036999998 0.001979899 -0.001979899)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (20 100 20) simpleGrading (1 1 1)
	hex	(1 0 3 2 9 8 11 10) (20 100 20) simpleGrading (1 1 1)
	hex	(5 1 2 6 13 9 10 14) (20 100 20) simpleGrading (1 1 1)
	hex	(4 5 6 7 12 13 14 15) (20 100 20) simpleGrading (1 1 1)
	hex	(0 4 7 3 8 12 15 11) (20 100 20) simpleGrading (1 1 1)
);
edges	(
	arc	0 1 (-0.0075 -6.576949e-4 0)
	arc	1 5 (-0.0075 0 6.576949e-4)
	arc	4 5 (-0.0075 6.576949e-4 0)
	arc	0 4 (-0.0075 0 -6.576949e-4)
	arc	3 2 (0.0036999998 -6.576949e-4 0)
	arc	2 6 (0.0036999998 0 6.576949e-4)
	arc	7 6 (0.0036999998 6.576949e-4 0)
	arc	3 7 (0.0036999998 0 -6.576949e-4)
	arc	8 9 (-0.0075 -0.0028 0)
	arc	9 13 (-0.0075 0 0.0028)
	arc	12 13 (-0.0075 0.0028 0)
	arc	8 12 (-0.0075 0 -0.0028)
	arc	11 10 (0.0036999998 -0.0028 0)
	arc	10 14 (0.0036999998 0 0.0028)
	arc	15 14 (0.0036999998 0.0028 0)
	arc	11 15 (0.0036999998 0 -0.0028)
);
boundary	(
	boundaries
	{
		type	wall;
		faces	(
			(13 14 15 12)
			(12 15 11 8)
			(8 11 10 9)
			(9 10 14 13)
			(3 7 6 2)
			(6 14 10 2)
			(2 10 11 3)
			(3 11 15 7)
			(7 15 14 6)
			(1 5 4 0)
			(5 13 12 4)
			(4 12 8 0)
			(0 8 9 1)
			(1 9 13 5)
		);
	}
);
