SimFlow/GasJet/SimpleTest/SimpleTest/system/fvSchemes
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSchemes;
}
fluxScheme	Kurganov;
ddtSchemes
{
	default	CrankNicolson 0.9;
}
gradSchemes
{
	default	Gauss linear;
}
divSchemes
{
	div(((rho*nuEff)*dev2(T(grad(U)))))	Gauss linear;
	div(R)	Gauss linear;
	div(tauMC)	Gauss linear;
	default	Gauss upwind;
	div(phiMRF,p)	Gauss limitedLinear 1.0;
	div(phi,k)	Gauss upwind;
	div(phi,epsilon)	Gauss upwind;
	div(phi,alphat)	Gauss upwind;
}
laplacianSchemes
{
	default	Gauss cubic corrected;
}
interpolationSchemes
{
	default	cubic;
	reconstruct(rho)	vanLeer;
	reconstruct(U)	vanLeerV;
	reconstruct(T)	vanLeer;
}
snGradSchemes
{
	default	corrected;
}
fluxRequired
{
	default	no;
}
wallDist
{
	method	meshWave;
	nRequired	false;
}
